FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_USBDeviceController.c
/*-------------------------------------------------------------------------*
 * Internal Function:  IIndexToEndpoint
 *---------------------------------------------------------------------------*/
/**
 *  Convert a LPC21xx USB endpoint index number to a standard
 *      endpoint identifier.
 *
 *  @param [in]    aIndex     	USB Hardware endpoint number
 *
 *  @return        TUInt8    	Endpoint number
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static INLINE TUInt8 IIndexToEndpoint(TUInt32 aIndex)
{
    TUInt8 endpointNum = (TUInt8) (aIndex>>1);
    endpointNum |= (aIndex & 1) << 7;
    return endpointNum;
}

/*-------------------------------------------------------------------------*
 * Internal Function:  IWaitForDeviceInterrupt
 *---------------------------------------------------------------------------*/
/**
 *  Wait for any of the given device interrupt flags to go from 1 to 0.
 *
 *  @param [in]    *p 					workspace
 *
 *  @param [in]    aDevInterruptFlags 	Flag(s) to wait to go from 0 to 1
 *
 *  @return        
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void IWaitForDeviceInterrupt(
                T_LPC1756_USBDev_Workspace *p,
                TUInt32 aDevInterruptFlags)
{
    PARAM_NOT_USED(p);
    while ((USB->USBDevIntSt & aDevInterruptFlags) != aDevInterruptFlags)
        {}
    USB->USBDevIntClr = aDevInterruptFlags;
}

/*-------------------------------------------------------------------------*
 * Internal Function:  ILPC1756_USBDev_Command
 *---------------------------------------------------------------------------*/
/**
 *  Put a command in the command buffer after clearing the command
 *      related device interrupt flags.
 *
 *  @param [in]    *p 			workspace
 *
 *  @param [in]    aCommand  	Command to send
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void ILPC1756_USBDev_Command(
            T_LPC1756_USBDev_Workspace *p,
            TUInt8 aCommand)
{
if (aCommand == USB_ENDPOINT_CMD_VALIDATE_BUFFER)
    dprintf("[Cmd V]");
else if (aCommand == USB_ENDPOINT_CMD_CLEAR_BUFFER)
    dprintf("[Cmd C]");
else if (aCommand <= 0x3F)
    dprintf("[Cmd S%d]", aCommand&0x3F);
else if ((aCommand & 0xC0)==0x40)
    dprintf("[Cmd SC%d]", aCommand&0x3F);
else if (aCommand == USB_DEVICE_CMD_SET_MODE)
    dprintf("[Cmd SM]");
else if (aCommand == USB_DEVICE_CMD_STATUS)
    ; // do nothing
else
    dprintf("[Cmd ?%02X]", aCommand);
    // Start by clearing the full and empty flags for the
    // command.
    USB->USBDevIntClr = CDFULL | CCEMTY;

    // Write a command in the form of:
    //    0x00CC0500
    //    where CC = 8-bit command
    USB->USBCmdCode = 0x00000500 | (aCommand << 16);

    // Wait for there to be room for another command
    IWaitForDeviceInterrupt(p, CCEMTY);
}

/*-------------------------------------------------------------------------*
 * Internal Function:  ILPC1756_USBDev_CommandAndWrite
 *---------------------------------------------------------------------------*/
/**
 *  Write a command and then write the data after it.
 *
 *  @param [in]    *p 			workspace
 *
 *  @param [in]    aCommand  	Command to send
 *
 *  @param [in]    aData     	Data to go after command
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void ILPC1756_USBDev_CommandAndWrite(
                T_LPC1756_USBDev_Workspace *p,
                TUInt8 aCommand,
                TUInt16 aData)
{
    // First, write the command
    ILPC1756_USBDev_Command(p, aCommand);

    // Then, write the data
    USB->USBCmdCode = 0x00000100 | (aData << 16);

    // Wait for room to be made available for more data
    IWaitForDeviceInterrupt(p, CCEMTY);
}

/*-------------------------------------------------------------------------*
 * Internal Function:  ILPC1756_USBDev_CommandAndRead
 *---------------------------------------------------------------------------*/
/**
 *  Write a command and then read the data after it.
 *
 *  @param [in]    *p			workspace
 *
 *  @param [in]    aCommand    	Command to send
 *
 *  @return        TUInt8     	Data received
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static TUInt8 ILPC1756_USBDev_CommandAndRead(
                T_LPC1756_USBDev_Workspace *p,
                TUInt8 aCommand)
{
    // First, write a command
    ILPC1756_USBDev_Command(p, aCommand);

    // Second, read back a byte
    USB->USBCmdCode = 0x00000200 | (aCommand << 16);

    // Wait until data is ready to be read
    IWaitForDeviceInterrupt(p, CDFULL);

    return (TUInt8)USB->USBCmdData;
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_InterruptNakEnable
 *---------------------------------------------------------------------------*/
/**
 *  Declares which NAK bits to produce interrupts on.
 *
 *  @param [in]    *aWorkspace 		workspace
 *
 *  @param [in]    aNakBits    		Or'd list of NAK bits to interrupt on
 *       
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void LPC1756_USBDev_InterruptNakEnable(
            void *aWorkspace,
            TUInt8 aNakBits)
{
    T_LPC1756_USBDev_Workspace *p = (T_LPC1756_USBDev_Workspace *)aWorkspace;

    ILPC1756_USBDev_CommandAndWrite(p, USB_DEVICE_CMD_SET_MODE, aNakBits);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_EndpointInterruptsEnable
 *---------------------------------------------------------------------------*/
/**
 *  Allow an endpoint to generate interrupts.
 *
 *  @param [in]    *aWorkspace 	workspace
 *
 *  @param [in]    aEndpoint  	Endpoint to trigger interrupts
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void LPC1756_USBDev_EndpointInterruptsEnable(
                void *aWorkspace,
                TUInt8 aEndpoint)
{
    TUInt32 aIndex = IEndpointToIndex(aEndpoint);

    // Enable interrupts for this endpoint
    // using regular "slow" method
    USB->USBEpIntEn |= (1 << aIndex);
    USB->USBDevIntEn |= EP_SLOW;
}

