FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_USBDeviceController.c
/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_EndpointInterruptsDisable
 *---------------------------------------------------------------------------*/
/**
 *  Allow an endpoint to generate interrupts.
 *
 *  @param [in]    *aWorkspace 		workspace
 *
 *  @param [in]    aEndpoint    	Endpoint to trigger interrupts
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void LPC1756_USBDev_EndpointInterruptsDisable(
                void *aWorkspace,
                TUInt8 aEndpoint)
{
    TUInt32 aIndex = IEndpointToIndex(aEndpoint);

    // Disable interrupts for this endpoint
    USB->USBEpIntEn &= ~(1 << aIndex);
}


/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_USBDev_InitializeWorkspace
 *---------------------------------------------------------------------------*/
/**
 *  Setup the workspace for this USBDev Controller
 *
 *  @param [in]    *aWorkspace       	Memory allocated for workspace area.
 *
 *  @return        T_uezError       	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_USBDev_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_USBDev_Workspace *p = (T_LPC1756_USBDev_Workspace *)aWorkspace;

    // Nothing is defined in this case
    p->iSettings.iUSBDevice = 0;
    p->iSettings.iUSBDescriptorTable = 0;

    // Remember this for the interrupt
    G_LPC1756_USBDev_Workspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_USBDev_Configure
 *---------------------------------------------------------------------------*/
/**
 *  Configure and setup the USBDev screen with the given settings
 *
 *  @param [in]    *aWorkspace    	USBDev Controller's workspace
 *
 *  @param [in]    *iSettings 		Pointer to settings to use
 *
 *  @return        T_uezError     	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_USBDev_Configure(
        void *aWorkspace,
        T_USBDeviceControllerSettings *iSettings)
{
    T_LPC1756_USBDev_Workspace *p = (T_LPC1756_USBDev_Workspace *)aWorkspace;

    // Copy over the configuration
    p->iSettings = *iSettings;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1756_USBDev_InterruptProcess
 *---------------------------------------------------------------------------*/
/**
 *  Process USB Device Interrupts
 *
 *  @param [in]    *p  	USBDev Controller's workspace
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void ILPC1756_USBDev_InterruptProcess(T_LPC1756_USBDev_Workspace *p)
{
    TUInt32 status;
    T_USBStatus usbStatus;
    T_USBDevice *p_dev = p->iSettings.iUSBDevice;

    status = USB->USBDevIntSt;

    if (status & DEV_STAT) {
        // Clear the device status change flag
        USB->USBDevIntClr = DEV_STAT;

        if (p_dev) {
            // Read the device status and run the callback (if it exists)
            usbStatus = (T_USBStatus)ILPC1756_USBDev_CommandAndRead(
                            p,
                            USB_DEVICE_CMD_STATUS);
            if (p_dev->iStatusChangeFunc)
                p_dev->iStatusChangeFunc(
                    p_dev->iCallbackWorkspace,
                    usbStatus);
        }
    }

    // Handle Endpoints (SLOW)
    if (status & EP_SLOW) {

#if 0
        USB->USBDevIntClr = EP_SLOW;
        // Handle endpoints with data on them
        for (i = 0; i < 32; i++) {
            if (USB->USBEpIntSt & (1<<i)) {
                // Clear the interrupt flag
                USB->USBEpIntClr = (1<<i);

                // Be sure wait for a command to be available
                IWaitForDeviceInterrupt(p, CDFULL);

                // Get the end point's status
                endpointStatus = USB->USBCmdData;

                // Call the end point handler
                if (i & 1)  {
                    if (p_dev->iEndpointFuncs[i>>1].iIn) {
                        p_dev->iEndpointFuncs[i>>1].iIn(
                            p_dev->iCallbackWorkspace,
                            IIndexToEndpoint(i),
                            endpointStatus);
                    } else {
                        // TBD: Clear the endpoint?
                    }
                } else {
                    if (p_dev->iEndpointFuncs[i>>1].iOut) {
                        p_dev->iEndpointFuncs[i>>1].iOut(
                            p_dev->iCallbackWorkspace,
                            IIndexToEndpoint(i),
                            endpointStatus);
                    } else {
                        // TBD: Clear the endpoint?
                    }
                }
            }
        }
#else
        if (p_dev->iStatusEndpointReadyFunc) {
            InterruptDisable(USB_IRQn);
            p_dev->iStatusEndpointReadyFunc(
                p_dev->iCallbackWorkspace);
        }
#endif
    }

    // USB_DEV_FRAME status?
    if (status & USB_DEV_FRAME) {
        // Clear USB_DEV_FRAME flag
        USB->USBDevIntClr = USB_DEV_FRAME;

        // Do nothing for now
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_USBDev_ProcessEndpoints
 *---------------------------------------------------------------------------*/
/**
 *  Determine if an endpoint is ready and if it is, call the function
 *      associated with that endpoint.  Clear any related interrupts.
 *
 *  @param [in]    *aWorkspace   	USBDev Controller's workspace
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
void LPC1756_USBDev_ProcessEndpoints(void *aWorkspace)
{
    T_LPC1756_USBDev_Workspace *p = (T_LPC1756_USBDev_Workspace *)aWorkspace;
    TUInt32 i;
    T_USBEndpointStatus endpointStatus;
    T_USBDevice *p_dev = p->iSettings.iUSBDevice;

    USB->USBDevIntClr = EP_SLOW;

