FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_USBDeviceController.c
    // Handle endpoints with data on them
    for (i = 0; i < 32; i++) {
        if (USB->USBEpIntSt & (1<<i)) {
            // Clear the interrupt flag
            USB->USBEpIntClr = (1<<i);

            if (p_dev) {
                // Be sure wait for a command to be available
                IWaitForDeviceInterrupt(p, CDFULL);

                // Get the end point's status
                endpointStatus = USB->USBCmdData;

                // Call the end point handler
                if (i & 1)  {
    dprintf("\n[IN%d]", i>>1);
                    if (p_dev->iEndpointFuncs[i>>1].iIn) {
                        p_dev->iEndpointFuncs[i>>1].iIn(
                            p_dev->iCallbackWorkspace,
                            IIndexToEndpoint(i),
                            endpointStatus);
                    } else {
                        // TBD: Clear the endpoint?
                    }
                } else {
    dprintf("\n[OUT%d]", i>>1);
                    if (p_dev->iEndpointFuncs[i>>1].iOut) {
                        p_dev->iEndpointFuncs[i>>1].iOut(
                            p_dev->iCallbackWorkspace,
                            IIndexToEndpoint(i),
                            endpointStatus);
                    } else {
                        // TBD: Clear the endpoint?
                    }
                }
            }
        }
    }

    // Ensure the interrupts are back on
    InterruptEnable(USB_IRQn);
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1756_USBDev_InterruptVector
 *---------------------------------------------------------------------------*/
/**
 *  Process USB Device Interrupts
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
void LPC1756_InterruptProcess_USBDevice(void)
{
    if (G_LPC1756_USBDev_Workspace)
        ILPC1756_USBDev_InterruptProcess(G_LPC1756_USBDev_Workspace);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_Connect
 *---------------------------------------------------------------------------*/
/**
 *  Connect to the USB bus.
 *
 *  @param [in]    *aWorkspace   	USBDev Controller's workspace
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void LPC1756_USBDev_Connect(void *aWorkspace)
{
    ILPC1756_USBDev_CommandAndWrite(
        (T_LPC1756_USBDev_Workspace *)aWorkspace,
        USB_DEVICE_CMD_STATUS,
        USB_STATUS_CONNECT);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_Disconnect
 *---------------------------------------------------------------------------*/
/**
 *  Disconnect from the USB bus.
 *
 *  @param [in]    *aWorkspace 	USBDev Controller's workspace
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void LPC1756_USBDev_Disconnect(void *aWorkspace)
{
    ILPC1756_USBDev_CommandAndWrite(
        (T_LPC1756_USBDev_Workspace *)aWorkspace,
        USB_DEVICE_CMD_STATUS,
        0x00);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_SetAddress
 *---------------------------------------------------------------------------*/
/**
 *  Sets the USB address for this device.
 *
 *  @param [in]    *aWorkspace 	USBDev Controller's workspace
 *
 *  @param [in]    aAddress  	7 bit address of this device.
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
void LPC1756_USBDev_SetAddress(void *aWorkspace, TUInt8 aAddress)
{
    ILPC1756_USBDev_CommandAndWrite(
        (T_LPC1756_USBDev_Workspace *)aWorkspace,
        USB_DEVICE_CMD_SET_ADDRESS,
        USB_DEVICE_SET_ADDRESS_ENABLE | aAddress);
    ILPC1756_USBDev_CommandAndWrite(
        (T_LPC1756_USBDev_Workspace *)aWorkspace,
        USB_DEVICE_CMD_SET_ADDRESS,
        USB_DEVICE_SET_ADDRESS_ENABLE | aAddress);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_DeviceIsConfigured
 *---------------------------------------------------------------------------*/
/**
 *  Declare the USB Device as configured.
 *
 *  @param [in]    *aWorkspace    	USBDev Controller's workspace
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
void LPC1756_USBDev_DeviceIsConfigured(void *aWorkspace)
{
    ILPC1756_USBDev_CommandAndWrite(
            (T_LPC1756_USBDev_Workspace *)aWorkspace,
            USB_DEVICE_CMD_CONFIG,
            USB_DEVICE_CONFIG);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_DeviceIsNotConfigured
 *---------------------------------------------------------------------------*/
/**
 *  Declare the USB Device as NOT configured.
 *
 *  @param [in]    *aWorkspace    	USBDev Controller's workspace
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
void LPC1756_USBDev_DeviceIsNotConfigured(void *aWorkspace)
{
    ILPC1756_USBDev_CommandAndWrite(
        (T_LPC1756_USBDev_Workspace *)aWorkspace,
        USB_DEVICE_CMD_CONFIG,
        0);
}


/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_Read
 *---------------------------------------------------------------------------*/
/**
 *  Read data from an endpoint
 *
 *  @param [in]    *aWorkspace     	USBDev Controller's workspace
 *
 *  @param [in]    aEndpoint      	Endpoint with data
 *
 *  @param [in]    *aData          	Pointer to place to put data.
 *
 *  @param [in]    iMaxLen          Maximum number of bytes for data.
 *
 *  @return        TInt16        	Number of bytes received, or -1
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
TInt16 LPC1756_USBDev_Read(
            void *aWorkspace,
            TUInt8 aEndpoint,
            TUInt8 *aData,
            TUInt16 iMaxLen)
{
    TUInt32 aIndex = IEndpointToIndex(aEndpoint);
    TUInt32 rxLength;
    TUInt32 rxData;
    T_LPC1756_USBDev_Workspace *p = (T_LPC1756_USBDev_Workspace *)aWorkspace;

dprintf("[R %d %d]", aEndpoint, iMaxLen);
    // Setup the endpoint for reading
    USB->USBCtrl = RD_EN | ((aEndpoint & 0xF) << 2);

    // Wait for the packet to be ready (or an error)
    while (1)  {
        if ((rxLength = USB->USBRxPLen) & PKT_RDY)
            break;
    }

    // Is data valid?
    if (!(rxLength & DV))
        return -1;

