FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_USBDeviceController.c
    // Data is valid.
    // Clean up and get the length.
    rxLength &= PKT_LNGTH_MASK;

    // Read data while it is available (32 bits at a time).
    while (USB->USBCtrl & RD_EN) {
        // Get the 32 bits (or less)
        rxData = USB->USBRxData;

        // Only store the data if there is a place to put it
        if (aData != 0) {
            // How much room is left?
            if (iMaxLen >= 4)  {
                // Do a group of 4 bytes quickly.
                // NOTE:  Compiler may optimize
                aData[0] = (rxData>>0) & 0xFF;
                aData[1] = (rxData>>8) & 0xFF;
                aData[2] = (rxData>>16) & 0xFF;
                aData[3] = (rxData>>24) & 0xFF;
                iMaxLen -= 4;
                aData += 4;
            } else {
                // Do a group of less than 4 bytes
                while (iMaxLen)  {
                    // One byte at a time
                    *(aData++) = rxData & 0xFF;
                    rxData >>= 8;
                    iMaxLen--;
                }
            }
        }
    }

    // Regardless of what happened above,
    // do a 'selection' and a 'clear' of the buffer
    ILPC1756_USBDev_Command(p, USB_ENDPOINT_CMD_SELECT | aIndex);
    ILPC1756_USBDev_Command(p, USB_ENDPOINT_CMD_CLEAR_BUFFER);

    return rxLength;
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_Write
 *---------------------------------------------------------------------------*/
/**
 *  Write data to an endpoint
 *
 *  @param [in]    *aWorkspace     	USBDev Controller's workspace
 *
 *  @param [in]    aEndpoint       	Endpoint to receive data
 *
 *  @param [in]    *aData         	Pointer to data to send.
 *
 *  @param [in]    aLength      	Number of bytes to send
 *
 *  @return        TUInt16       	aLength
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
TUInt16 LPC1756_USBDev_Write(
                void *aWorkspace,
                TUInt8 aEndpoint,
                TUInt8 *aData,
                TUInt16 aLength)
{
    T_LPC1756_USBDev_Workspace *p = (T_LPC1756_USBDev_Workspace *)aWorkspace;
    TUInt32 aIndex = IEndpointToIndex(aEndpoint);

dprintf("[W %d %d]", aEndpoint, aLength);
    // Enable writing to the end point and the number of bytes to be written
    USB->USBCtrl = WR_EN | ((aEndpoint & 0xF) << 2);
    USB->USBTxPLen = aLength;

    if (aLength == 0)  {
        while (USB->USBCtrl & WR_EN)  {
            // Just force zeroes into without using
            // the pointer.
            USB->USBTxData = 0;
        }
    } else {
        // Write data as long as it lets us
        while (USB->USBCtrl & WR_EN)  {
            // Write in 32 bit blocks
            USB->USBTxData =
                (aData[3] << 24) |
                (aData[2] << 16) |
                (aData[1] << 8) |
                aData[0];
            aData += 4;
        }
    }

    // Do a 'select' and 'validate' on the endpoint
    ILPC1756_USBDev_Command(p, USB_ENDPOINT_CMD_SELECT | aIndex);
    ILPC1756_USBDev_Command(p, USB_ENDPOINT_CMD_VALIDATE_BUFFER);

    return aLength;
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_SetStallState
 *---------------------------------------------------------------------------*/
/**
 *  Set the stall state of an endpoint
 *
 *  @param [in]    *aWorkspace   USBDev Controller's workspace
 *
 *  @param [in]    aEndpoint     Endpoint to set to stalled or not stalled.
 *
 *  @param [in]    aStallState   ETrue for stall, else EFalse for not stalled.
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
void LPC1756_USBDev_SetStallState(
            void *aWorkspace,
            TUInt8 aEndpoint,
            TBool aStallState)
{
dprintf("ST %d %d\n", aEndpoint, aStallState);
    // Write the stall bit of the end point.
    ILPC1756_USBDev_CommandAndWrite(
        (T_LPC1756_USBDev_Workspace *)aWorkspace,
        USB_ENDPOINT_CMD_SET_STATUS | IEndpointToIndex(aEndpoint),
        aStallState ? ENDPOINT_STATUS_STALLED : 0);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_IsStalled
 *---------------------------------------------------------------------------*/
/**
 *  Determine if an endpoint is stalled.
 *
 *  @param [in]    *aWorkspace      	USBDev Controller's workspace
 *
 *  @param [in]    aEndpoint        	Endpoint to check if stalled
 *
 *  @return        TBool         		ETrue if stalled, else EFalse
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
TBool LPC1756_USBDev_IsStalled(void *aWorkspace, TUInt8 aEndpoint)
{
    // Determine if the endpoint's stalled bit is set.
    return (ILPC1756_USBDev_CommandAndRead(
                (T_LPC1756_USBDev_Workspace *)aWorkspace,
                USB_ENDPOINT_CMD_SELECT |
                    IEndpointToIndex(aEndpoint)) &
                ENDPOINT_STATUS_STALLED);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_SetConfiguration
 *---------------------------------------------------------------------------*/
/**
 *  Go through the descriptor table and enable all endpoints for
 *      the given descriptor index and alternative setting.
 *      All corresponding endpoints are configured for matches.
 *
 *  @param [in]    *aWorkspace    		USBDev Controller's workspace
 *
 *  @param [in]    aConfigurationIndex	Descriptor index of config to use.
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void LPC1756_USBDev_SetConfiguration(
                void *aWorkspace,
                TUInt8 aConfigurationIndex)
{
    T_LPC1756_USBDev_Workspace *p_workspace =
            (T_LPC1756_USBDev_Workspace *)aWorkspace;
    const TUInt8 *p = p_workspace->iSettings.iUSBDescriptorTable;
//    TUInt8 configuration = 0x80;

    T_USBDescriptorHeader *p_header = (T_USBDescriptorHeader *)p;

dprintf("\n\n---> [Cf %d]", aConfigurationIndex);

