FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_USBDeviceController.c
    // Index currently is 0 or non-zero.  If 0, it means
    // we are closing out the configuration.  Is it a zero?
    if (aConfigurationIndex == 0)  {
        // Yes, then kill the configuration
        LPC1756_USBDev_DeviceIsNotConfigured(aWorkspace);
    } else {
        // Otherwise, we are going to use the existing configuration
        while (p_header->iLength)  {
            if (p_header->iDescriptorType == USB_DESCRIPTOR_CONFIGURATION)  {
                // Found a configuration, the following
                // descriptors are now in that configuration
//                configuration =
//                    ((T_USBDescriptorConfiguration *)p)->iConfigurationValue;
            } else if (p_header->iDescriptorType == USB_DESCRIPTOR_ENDPOINT)  {
                // Only configure this endpoint if we have a matching
                // configuration number and alternate setting number.
                #define p_endpoint ((T_USBDescriptorEndpoint *)p)
                LPC1756_USBDev_EndpointConfigure(
                    aWorkspace,
                    p_endpoint->iAddress,
                    p_endpoint->iMaximumPacketSize);
            }
            // Next descriptor
            p += p_header->iLength;
            p_header = (T_USBDescriptorHeader *)p;
        }
        // Got to the end
        // Report that this device is configured.
        LPC1756_USBDev_DeviceIsConfigured((void *)p_workspace);
    }

    // Remember our configuration number
    p_workspace->iConfigurationNumber = aConfigurationIndex;
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_GetConfiguration
 *---------------------------------------------------------------------------*/
/**
 *  Go through the descriptor table and enable all endpoints for
 *      the given descriptor index and alternative setting.
 *      All corresponding endpoints are configured for matches.
 *
 *  @param [in]    *aWorkspace  USBDev Controller's workspace
 *
 *  @return        TUInt8 		Config Index Descriptor - index of config in use.
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static TUInt8 LPC1756_USBDev_GetConfiguration(
                void *aWorkspace)
{
    T_LPC1756_USBDev_Workspace *p_workspace =
            (T_LPC1756_USBDev_Workspace *)aWorkspace;

    // Report our configuration
    return p_workspace->iConfigurationNumber;
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1756_USBDev_ForceAddressAndConfiguration
 *---------------------------------------------------------------------------*/
/**
 *  Force the USB to go to a given address and configuration.
 *
 *  @param [in]    *aWorkspace     	USBDev Controller's workspace
 *
 *  @param [in]    aAddress      	Address of connection
 *
 *  @param [in]    aConfigNum   	Number of configuration to use
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
void LPC1756_USBDev_ForceAddressAndConfiguration(
            void *aWorkspace,
            TUInt8 aAddress,
            TUInt8 aConfigNum)
{
    T_LPC1756_USBDev_Workspace *p = (T_LPC1756_USBDev_Workspace *)aWorkspace;

    LPC1756_USBDev_SetAddress(aWorkspace, aAddress);
    LPC1756_USBDev_SetConfiguration(aWorkspace, aConfigNum);
    p->iConfigurationNumber = aConfigNum;
}

/*---------------------------------------------------------------------------*
 * Internal Function:  IEndpointEnable
 *---------------------------------------------------------------------------*/
/**
 *  Enable endpoint.
 *
 *  @param [in]    *p 			workspace
 *
 *  @param [in]    aIndex    	Index of endpoint
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void LPC1756_USBDev_EndpointEnable(
                T_LPC1756_USBDev_Workspace *p,
                int aIndex)
{
    ILPC1756_USBDev_CommandAndWrite(
        p,
        USB_ENDPOINT_CMD_SET_STATUS | aIndex,
        0);
}

/*-------------------------------------------------------------------------*
 * Internal Function:  LPC1756_USBDev_EndpointDisable
 *---------------------------------------------------------------------------*/
/**
 *  Disable endpoint.
 *
 *  @param [in]    *p 			workspace
 *
 *  @param [in]    aIndex    	Index of endpoint
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
#if 0
static void LPC1756_USBDev_EndpointDisable(
                T_LPC1756_USBDev_Workspace *p,
                int aIndex)
{
    ILPC1756_USBDev_CommandAndWrite(
            p,
            USB_ENDPOINT_CMD_SET_STATUS | aIndex,
            ENDPOINT_STATUS_DISABLED);
}
#endif

/*-------------------------------------------------------------------------*
 * Internal Function:  LPC1756_USBDev_EndpointRealize
 *---------------------------------------------------------------------------*/
/**
 *  Realize an endpoint by telling the hardware to reserve space and
 *      to set the maximum packet size.
 *
 *  @param [in]    *p 				workspace
 *
 *  @param [in]    aIndex         	Index of endpoint
 *
 *  @param [in]    aMaxPacketSize	Maximum size of packet (in bytes)
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void LPC1756_USBDev_EndpointRealize(
                T_LPC1756_USBDev_Workspace *p,
                TUInt32 aIndex,
                TUInt16 aMaxPacketSize)
{
    // Declare which endpoint is going to be realized
    // using a bit position.
    USB->USBReEp |= (1 << aIndex);
    USB->USBEpInd = aIndex;

    // Declare size of maximum packets
    USB->USBMaxPSize = aMaxPacketSize;

    // Wait for endpoint to be fully realized
    IWaitForDeviceInterrupt(p, EP_RLZED);
}

